Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_gv_vl_cnano/pic32cm_gv_vl_cnano_getting_started/firmware/src/packs/PIC32CM3204GV00064_DFP/component/pm.h
#define PM_INTENSET_CKRDY_Pos                 _UINT8_(0)                                           /* (PM_INTENSET) Clock Ready Interrupt Enable Position */
#define PM_INTENSET_CKRDY_Msk                 (_UINT8_(0x1) << PM_INTENSET_CKRDY_Pos)              /* (PM_INTENSET) Clock Ready Interrupt Enable Mask */
#define PM_INTENSET_CKRDY(value)              (PM_INTENSET_CKRDY_Msk & (_UINT8_(value) << PM_INTENSET_CKRDY_Pos)) /* Assignment of value for CKRDY in the PM_INTENSET register */
#define PM_INTENSET_Msk                       _UINT8_(0x01)                                        /* (PM_INTENSET) Register Mask  */


/* -------- PM_INTFLAG : (PM Offset: 0x36) (R/W 8) Interrupt Flag Status and Clear -------- */
#define PM_INTFLAG_RESETVALUE                 _UINT8_(0x00)                                        /*  (PM_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define PM_INTFLAG_CKRDY_Pos                  _UINT8_(0)                                           /* (PM_INTFLAG) Clock Ready Position */
#define PM_INTFLAG_CKRDY_Msk                  (_UINT8_(0x1) << PM_INTFLAG_CKRDY_Pos)               /* (PM_INTFLAG) Clock Ready Mask */
#define PM_INTFLAG_CKRDY(value)               (PM_INTFLAG_CKRDY_Msk & (_UINT8_(value) << PM_INTFLAG_CKRDY_Pos)) /* Assignment of value for CKRDY in the PM_INTFLAG register */
#define PM_INTFLAG_Msk                        _UINT8_(0x01)                                        /* (PM_INTFLAG) Register Mask  */


/* -------- PM_RCAUSE : (PM Offset: 0x38) ( R/ 8) Reset Cause -------- */
#define PM_RCAUSE_RESETVALUE                  _UINT8_(0x01)                                        /*  (PM_RCAUSE) Reset Cause  Reset Value */

#define PM_RCAUSE_POR_Pos                     _UINT8_(0)                                           /* (PM_RCAUSE) Power On Reset Position */
#define PM_RCAUSE_POR_Msk                     (_UINT8_(0x1) << PM_RCAUSE_POR_Pos)                  /* (PM_RCAUSE) Power On Reset Mask */
#define PM_RCAUSE_POR(value)                  (PM_RCAUSE_POR_Msk & (_UINT8_(value) << PM_RCAUSE_POR_Pos)) /* Assignment of value for POR in the PM_RCAUSE register */
#define PM_RCAUSE_BOD12_Pos                   _UINT8_(1)                                           /* (PM_RCAUSE) Brown Out 12 Detector Reset Position */
#define PM_RCAUSE_BOD12_Msk                   (_UINT8_(0x1) << PM_RCAUSE_BOD12_Pos)                /* (PM_RCAUSE) Brown Out 12 Detector Reset Mask */
#define PM_RCAUSE_BOD12(value)                (PM_RCAUSE_BOD12_Msk & (_UINT8_(value) << PM_RCAUSE_BOD12_Pos)) /* Assignment of value for BOD12 in the PM_RCAUSE register */
#define PM_RCAUSE_BOD33_Pos                   _UINT8_(2)                                           /* (PM_RCAUSE) Brown Out 33 Detector Reset Position */
#define PM_RCAUSE_BOD33_Msk                   (_UINT8_(0x1) << PM_RCAUSE_BOD33_Pos)                /* (PM_RCAUSE) Brown Out 33 Detector Reset Mask */
#define PM_RCAUSE_BOD33(value)                (PM_RCAUSE_BOD33_Msk & (_UINT8_(value) << PM_RCAUSE_BOD33_Pos)) /* Assignment of value for BOD33 in the PM_RCAUSE register */
#define PM_RCAUSE_EXT_Pos                     _UINT8_(4)                                           /* (PM_RCAUSE) External Reset Position */
#define PM_RCAUSE_EXT_Msk                     (_UINT8_(0x1) << PM_RCAUSE_EXT_Pos)                  /* (PM_RCAUSE) External Reset Mask */
#define PM_RCAUSE_EXT(value)                  (PM_RCAUSE_EXT_Msk & (_UINT8_(value) << PM_RCAUSE_EXT_Pos)) /* Assignment of value for EXT in the PM_RCAUSE register */
#define PM_RCAUSE_WDT_Pos                     _UINT8_(5)                                           /* (PM_RCAUSE) Watchdog Reset Position */
#define PM_RCAUSE_WDT_Msk                     (_UINT8_(0x1) << PM_RCAUSE_WDT_Pos)                  /* (PM_RCAUSE) Watchdog Reset Mask */
#define PM_RCAUSE_WDT(value)                  (PM_RCAUSE_WDT_Msk & (_UINT8_(value) << PM_RCAUSE_WDT_Pos)) /* Assignment of value for WDT in the PM_RCAUSE register */
#define PM_RCAUSE_SYST_Pos                    _UINT8_(6)                                           /* (PM_RCAUSE) System Reset Request Position */
#define PM_RCAUSE_SYST_Msk                    (_UINT8_(0x1) << PM_RCAUSE_SYST_Pos)                 /* (PM_RCAUSE) System Reset Request Mask */
#define PM_RCAUSE_SYST(value)                 (PM_RCAUSE_SYST_Msk & (_UINT8_(value) << PM_RCAUSE_SYST_Pos)) /* Assignment of value for SYST in the PM_RCAUSE register */
#define PM_RCAUSE_Msk                         _UINT8_(0x77)                                        /* (PM_RCAUSE) Register Mask  */

#define PM_RCAUSE_BOD_Pos                     _UINT8_(1)                                           /* (PM_RCAUSE Position) Brown Out x2 Detector Reset */
#define PM_RCAUSE_BOD_Msk                     (_UINT8_(0x3) << PM_RCAUSE_BOD_Pos)                  /* (PM_RCAUSE Mask) BOD */
#define PM_RCAUSE_BOD(value)                  (PM_RCAUSE_BOD_Msk & (_UINT8_(value) << PM_RCAUSE_BOD_Pos)) 

/* PM register offsets definitions */
#define PM_CTRL_REG_OFST               _UINT32_(0x00)      /* (PM_CTRL) Control Offset */
#define PM_SLEEP_REG_OFST              _UINT32_(0x01)      /* (PM_SLEEP) Sleep Mode Offset */
#define PM_CPUSEL_REG_OFST             _UINT32_(0x08)      /* (PM_CPUSEL) CPU Clock Select Offset */
#define PM_APBASEL_REG_OFST            _UINT32_(0x09)      /* (PM_APBASEL) APBA Clock Select Offset */
#define PM_APBBSEL_REG_OFST            _UINT32_(0x0A)      /* (PM_APBBSEL) APBB Clock Select Offset */
#define PM_APBCSEL_REG_OFST            _UINT32_(0x0B)      /* (PM_APBCSEL) APBC Clock Select Offset */
#define PM_AHBMASK_REG_OFST            _UINT32_(0x14)      /* (PM_AHBMASK) AHB Mask Offset */
#define PM_APBAMASK_REG_OFST           _UINT32_(0x18)      /* (PM_APBAMASK) APBA Mask Offset */
#define PM_APBBMASK_REG_OFST           _UINT32_(0x1C)      /* (PM_APBBMASK) APBB Mask Offset */
#define PM_APBCMASK_REG_OFST           _UINT32_(0x20)      /* (PM_APBCMASK) APBC Mask Offset */
#define PM_INTENCLR_REG_OFST           _UINT32_(0x34)      /* (PM_INTENCLR) Interrupt Enable Clear Offset */
#define PM_INTENSET_REG_OFST           _UINT32_(0x35)      /* (PM_INTENSET) Interrupt Enable Set Offset */
#define PM_INTFLAG_REG_OFST            _UINT32_(0x36)      /* (PM_INTFLAG) Interrupt Flag Status and Clear Offset */
#define PM_RCAUSE_REG_OFST             _UINT32_(0x38)      /* (PM_RCAUSE) Reset Cause Offset */

